//TLAB014@ JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=TLAB014.MYLIB.LOADLIB,DISP=SHR
//STEP01   EXEC PGM=ICT02CBM
//INPKS    DD DSN=TLAB014.MYDATA.ICT02.KSDS,DISP=SHR
//OUTPS    DD DSN=TLAB014.MYDATA.ICT02.PS3,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(2,2)),
//            DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)